tests/load/jmeter-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1266,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1071.9549763033199,
    "medianResTime" : 772.0,
    "minResTime" : 3.0,
    "maxResTime" : 4234.0,
    "pct1ResTime" : 2413.0,
    "pct2ResTime" : 2507.2999999999997,
    "pct3ResTime" : 3186.949999999999,
    "throughput" : 10.500298586689668,
    "receivedKBytesPerSec" : 17.759517385935737,
    "sentKBytesPerSec" : 5.388240777507299
  },
  "GET /api/ovas" : {
    "transaction" : "GET /api/ovas",
    "sampleCount" : 415,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 794.4987951807234,
    "medianResTime" : 771.0,
    "minResTime" : 753.0,
    "maxResTime" : 1733.0,
    "pct1ResTime" : 825.4000000000001,
    "pct2ResTime" : 909.1999999999999,
    "pct3ResTime" : 1480.7199999999966,
    "throughput" : 3.581538249102458,
    "receivedKBytesPerSec" : 12.297606343098419,
    "sentKBytesPerSec" : 1.6963340339987227
  },
  "POST /api/auth/login" : {
    "transaction" : "POST /api/auth/login",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1095.88,
    "medianResTime" : 1006.0,
    "minResTime" : 980.0,
    "maxResTime" : 1976.0,
    "pct1ResTime" : 1479.6000000000015,
    "pct2ResTime" : 1948.3999999999999,
    "pct3ResTime" : 1976.0,
    "throughput" : 3.556693697538768,
    "receivedKBytesPerSec" : 3.9158364009816475,
    "sentKBytesPerSec" : 0.9447467634087352
  },
  "GET /health" : {
    "transaction" : "GET /health",
    "sampleCount" : 421,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.622327790973871,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 160.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 25.899999999999864,
    "throughput" : 3.5938673769036398,
    "receivedKBytesPerSec" : 1.4600586404339957,
    "sentKBytesPerSec" : 1.6705867884825514
  },
  "POST /api/auth/register" : {
    "transaction" : "POST /api/auth/register",
    "sampleCount" : 405,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2462.2049382716045,
    "medianResTime" : 2388.0,
    "minResTime" : 2354.0,
    "maxResTime" : 4234.0,
    "pct1ResTime" : 2576.8,
    "pct2ResTime" : 2759.6999999999994,
    "pct3ResTime" : 3513.14,
    "throughput" : 3.5055526222399185,
    "receivedKBytesPerSec" : 4.481219123546927,
    "sentKBytesPerSec" : 2.170430041504012
  }
}